<template>

  <div class="flex">
    <div class="container mx-auto mt-4 mb-24 px-4">
      <h2 class="text-4xl text-center my-8">How slots work</h2>

      <AboutLayout>
        <template #introduction>
          <div class="leading-6 my-4">
            <p>В далеком будущем, когда человечество освоило космос и отправилось на звёздные экспедиции, оно взяло с
              собой верных спутников - котов. Как оказалось, коты были идеальными астронавтами. Их ловкость,
              независимость и чувство равновесия делали их отличными космонавтами.</p>
            <br>
            <p>Коты в скафандрах стали исследовать новые миры и адаптировались к невесомости легче, чем человек. Они
              прыгали с одного модуля на другой, изучали астероиды и планеты, и, конечно, охотились за летающими
              метеоритами.</p>
            <br>
            <p>С каждым днем коты обнаруживали новые удивительные особенности космоса. Их мурлыканье становилось
              бережной песней к бескрайней черноте космоса. Они становились искусными навигаторами и всегда возвращались
              домой после долгих космических путешествий.</p>
            <br>
            <p>И, возможно, самое удивительное - коты обнаружили, что в некоторых уголках космоса существует
              местоположение, где скребки для когтей работают особенно хорошо. Они назвали это место "Скребковым Раем" и
              возвращались туда снова и снова.</p>
            <br>
            <p>Таким образом, коты в космосе стали символами приключений и исследований. Их маленькие лапки оставили
              следы на марсианских песчаных дюнах, и их мурчание сопровождало человечество в его стремлении к
              звёздам.</p>
          </div>
        </template>
        <template #rewards>
            <div class="text-center text-2xl my-8">Cats astronauts</div>
            <CatList />
        </template>
      </AboutLayout>
    </div>
  </div>
</template>

<style></style>
<script>export default {
  components: {}
}
</script>

<script setup>
import AboutLayout from "./../components/about/AboutLayout.vue";
import CatList from "./../components/about/CatList.vue";
</script>
